Emacs.org
#+title JMACS Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Documentation
** Helpful commands
*** Tangling Output
(org-babel-tangle)
(org-babel-tangle-file "~/.emacs.d/Emacs.org")

*** Open code block
{C-c '}
*** Tramp
C-x C-f /sshx:amazon:
e.g. C-x C-f /sshx:<ssh config name>:PATH
* Basic UI Configuration
** Simple Emacs Changes
#+begin_src emacs-lisp
      (setq inhibit-startup-message t)

      (scroll-bar-mode -1)                ; Disable visible scrollbar
      (tool-bar-mode -1)                  ; Disable the toolbar
      (tooltip-mode -1)                   ; Disable tooltips
      ; (set-fringe-mode 10)                ; Give some breathing room

      (menu-bar-mode 1)                  ; Remove the menu bar
      (setq visible-bell nil)             ; Remove visible-bell
      (setq ring-bell-function 'ignore)   ; Remove sound (notification)

    ;; Line number
    (column-number-mode)
    (global-display-line-numbers-mode 1)
    (dolist (mode '(org-mode-hook
                    term-mode-hook
                    shell-mode-hook
                    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))
  ; (whitespace-mode) ; See whitespaces
  ;; Fix smooth scrolling
  (setq redisplay-dont-pause t)
#+end_src

** Font Configuration
#+begin_src emacs-lisp 
    (set-face-attribute 'default nil :font "Consolas" :height 150) ; Font
    (set-face-attribute 'fixed-pitch nil :font "Consolas" :height 150) ; Font
    (set-face-attribute 'variable-pitch nil :font "Cantarell" :height 150 :weight 'regular) ; Font
#+end_src

** Transparency
#+begin_src emacs-lisp
;; set transparency
(set-frame-parameter (selected-frame) 'alpha '(99 99))
(add-to-list 'default-frame-alist '(alpha 99 99))
#+end_src
** Text Wrap
#+begin_src emacs-lisp
(visual-line-mode t)
#+end_src
** Neo tree
#+begin_src emacs-lisp
(use-package neotree)
#+end_src
* Mac Specific
** Switch Option and CMD
#+begin_src emacs-lisp
  ;; Switch option and command

;; Add extra/default MacOS commands to work with hyper key
  (global-set-key [(hyper a)] 'mark-whole-buffer)
  (global-set-key [(hyper v)] 'yank)
  (global-set-key [(hyper c)] 'kill-ring-save)
  (global-set-key [(hyper s)] 'save-buffer)
  (global-set-key [(hyper l)] 'goto-line)
  (global-set-key [(hyper w)]
                  (lambda () (interactive) (delete-window)))
  (global-set-key [(hyper z)] 'undo)
  (global-set-key [(hyper q)] 'save-buffers-kill-emacs)

  ;; Mac related stuff
  ;; Switch option and command key
  (setq mac-option-modifier 'meta) ; Set option as meta
  (setq mac-command-modifier 'hyper) ; Set cmd as hyper
  ;; mac switch meta key
  ; see: https://gist.github.com/railwaycat/3498096
  (defun mac-switch-meta nil 
    "switch meta between Option and Command"
    (interactive)
    (if (eq mac-option-modifier nil)
        (progn
          (setq mac-option-modifier 'meta)
          (setq mac-command-modifier 'hyper)
          )
      (progn 
        (setq mac-option-modifier nil)
        (setq mac-command-modifier 'meta)
        )
      )
    )
#+end_src

** Show in finder
#+begin_src emacs-lisp
;; Open in finder
(defun show-in-finder nil
  (interactive)
  (shell-command (concat "open -R " buffer-file-name)))
#+end_src

* Package System Setup
#+begin_src emacs-lisp
;; Initialize Package Sources
(require 'package)
(setq use-package-always-ensure t)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Always refresh, otherwise it is a bit annoying
(package-refresh-contents)

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
#+end_src
* Fixes
** Smooth scrolling
#+begin_src emacs-lisp
(use-package smooth-scrolling)
(require 'smooth-scrolling)
(smooth-scrolling-mode 1)
#+end_src
** Dired (auto refresh)
#+begin_src emacs-lisp
;; Auto-refresh dired on file change
(add-hook 'dired-mode-hook 'auto-revert-mode)
#+end_src
** Split Swap
#+begin_src emacs-lisp
(defun swap-split-direction nil
  (interactive)
  (if (eq split-height-threshold 0)
      (progn
	(setq split-height-threshold nil)
	(setq split-width-threshold 0)
	)
    (progn
	(setq split-height-threshold 0)
	(setq split-width-threshold nil))))

(setq split-height-threshold nil)
(setq split-width-threshold 0)
#+end_src
** Desktop Save
#+begin_src emacs-lisp
(desktop-save-mode 1)
#+end_src
** exec-path-from-shell
Shell fixes
For help: https://github.com/pythonic-emacs/pyenv-mode/issues/32
This fixes the problem of (e.g.) pyenv not found (.zshrc).
#+begin_src emacs-lisp
(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))
#+end_src
* Keybinding Configuration
** Esc Quit Prompts
#+begin_src emacs-lisp
;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
** Evil Mode
*** Init
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump t))
(require 'evil)
(evil-mode 1)
#+end_src
*** Start State
#+begin_src emacs-lisp
;; Changes what state evil starts in
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
#+end_src
*** Fix Move Up
#+begin_src emacs-lisp
(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-normal-state-map (kbd "C-b") 'evil-scroll-up)
(define-key evil-visual-state-map (kbd "C-b") 'evil-scroll-up)
(define-key evil-insert-state-map (kbd "C-b")
  (lambda ()
    (interactive)
    (evil-delete (point-at-bol) (point))))

(define-key evil-normal-state-map (kbd "gd") 'lsp-find-definition)
#+end_src
*** Move j/k Visual (no line jump)
#+begin_src emacs-lisp
;; Changes such that it moves naturally up and down (not skip lines from visiual perspective)
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
#+end_src
*** Evil Collection
Fixes the keybinding of Evil for different packages.
#+begin_src emacs-lisp
;; Updates the keys in certain modes (e.g. magit can use hjkl etc. etc.)
  (use-package evil-collection
    :after (evil magit)
    :config
    (evil-collection-init))
#+end_src
** Custom Keybindings
*** General
This is a helper package for setting custom keybindings.
#+begin_src emacs-lisp
    (use-package general
      :init (general-auto-unbind-keys)
      :config
      (general-evil-setup t)
      (general-create-definer jmacs/leader-keys
                              :keymaps '(normal insert visual emacs dired-mode-map doc-view-mode-map)
                              :prefix "SPC"
                              :global-prefix "C-f"))
#+end_src
*** Keybindings::jmacs
This is my personal keybindings.
#+begin_src emacs-lisp
  (jmacs/leader-keys
   "f" '(counsel-find-file :which-key "find file")
   "e" '(eval-last-sexp :which-key "eval last exp")
   "SPC" '(counsel-M-x :which-key "runs command")
   "g" '(magit :which-key "magit")
   "p" '(projectile-command-map :which-key "projectile command map")
   "s" '(counsel-projectile-rg :which-key "search current project")
   "ch" '(hippie-expand :which-key "Autocomplete file path")
   "d" '(dired :which-key "dired")
   "r" '(ranger :which-key "ranger")
   "b" '(:ignore t :which-key "buffers")
   "bb" '(counsel-ibuffer :which-key "switch buffer")
   "bl" '(ibuffer :which-key "list buffers")
   "bk" '(kill-buffer :which-key "kill buffer")
   "bs" '(hydra-buffer-switch/body :which-key "switch buffer quickly")
   "bc" '(clean-buffer-list :which-key "clean unused buffers")
   "t" '(:ignore t :which-key "toggles")
   "tt" '(counsel-load-theme :which-key "choose theme")
   "ts" '(hydra-text-scale/body :which-key "scale text")
   ; "tf" '(hydra-code-level/body :which-key "Different fold level")
   "o" '(:ignore t :which-key "org")
   "oa" '(org-agenda :which-key "agenda")
   "os" '(org-agenda :which-key "schedule")
   "od" '(org-agenda :which-key "deadline")
   "ot" '(org-time-stamp :which-key "time-stamp"))
   (global-set-key [(hyper p)] 'projectile-find-file)
   (global-set-key [(hyper b)] 'neotree-toggle)
   (global-set-key [(hyper .)] 'flyspell-correct-wrapper)
   (global-set-key [(hyper j)] 'shell-pop)
   (global-set-key [(hyper =)] 'text-scale-increase)
   (global-set-key [(hyper -)] 'text-scale-decrease)
   (global-set-key [(hyper t)] 'tab-bar-switch-to-tab)
   (global-set-key [(hyper T)] 'tab-new)
   (global-set-key [(hyper K)] 'tab-bar-close-tab)
   (global-set-key [(hyper k)] 'tab-bar-switch-to-recent-tab)

#+end_src
