init.el
(setq inhibit-startup-message t)

    (scroll-bar-mode -1)                ; Disable visible scrollbar
    (tool-bar-mode -1)                  ; Disable the toolbar
    (tooltip-mode -1)                   ; Disable tooltips
    ; (set-fringe-mode 10)                ; Give some breathing room

    (menu-bar-mode 1)                  ; Remove the menu bar
    (setq visible-bell nil)             ; Remove visible-bell
    (setq ring-bell-function 'ignore)   ; Remove sound (notification)

  ;; Line number
  (column-number-mode)
  (global-display-line-numbers-mode 1)
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
; (whitespace-mode) ; See whitespaces
;; Fix smooth scrolling
(setq redisplay-dont-pause t)

(set-face-attribute 'default nil :font "Consolas" :height 150) ; Font
(set-face-attribute 'fixed-pitch nil :font "Consolas" :height 150) ; Font
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 150 :weight 'regular) ; Font

;; set transparency
(set-frame-parameter (selected-frame) 'alpha '(99 99))
(add-to-list 'default-frame-alist '(alpha 99 99))

(visual-line-mode t)

(use-package neotree)

;; Switch option and command

;; Add extra/default MacOS commands to work with hyper key
  (global-set-key [(hyper a)] 'mark-whole-buffer)
  (global-set-key [(hyper v)] 'yank)
  (global-set-key [(hyper c)] 'kill-ring-save)
  (global-set-key [(hyper s)] 'save-buffer)
  (global-set-key [(hyper l)] 'goto-line)
  (global-set-key [(hyper w)]
                  (lambda () (interactive) (delete-window)))
  (global-set-key [(hyper z)] 'undo)
  (global-set-key [(hyper q)] 'save-buffers-kill-emacs)

  ;; Mac related stuff
  ;; Switch option and command key
  (setq mac-option-modifier 'meta) ; Set option as meta
  (setq mac-command-modifier 'hyper) ; Set cmd as hyper
  ;; mac switch meta key
  ; see: https://gist.github.com/railwaycat/3498096
  (defun mac-switch-meta nil 
    "switch meta between Option and Command"
    (interactive)
    (if (eq mac-option-modifier nil)
        (progn
          (setq mac-option-modifier 'meta)
          (setq mac-command-modifier 'hyper)
          )
      (progn 
        (setq mac-option-modifier nil)
        (setq mac-command-modifier 'meta)
        )
      )
    )

;; Open in finder
(defun show-in-finder nil
  (interactive)
  (shell-command (concat "open -R " buffer-file-name)))

;; Initialize Package Sources
(require 'package)
(setq use-package-always-ensure t)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; Always refresh, otherwise it is a bit annoying
(package-refresh-contents)

;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(use-package smooth-scrolling)
(require 'smooth-scrolling)
(smooth-scrolling-mode 1)

;; Auto-refresh dired on file change
(add-hook 'dired-mode-hook 'auto-revert-mode)

(defun swap-split-direction nil
  (interactive)
  (if (eq split-height-threshold 0)
      (progn
	(setq split-height-threshold nil)
	(setq split-width-threshold 0)
	)
    (progn
	(setq split-height-threshold 0)
	(setq split-width-threshold nil))))

(setq split-height-threshold nil)
(setq split-width-threshold 0)

(desktop-save-mode 1)

(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package evil
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump t))
(require 'evil)
(evil-mode 1)

;; Changes what state evil starts in
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)

(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-normal-state-map (kbd "C-b") 'evil-scroll-up)
(define-key evil-visual-state-map (kbd "C-b") 'evil-scroll-up)
(define-key evil-insert-state-map (kbd "C-b")
  (lambda ()
    (interactive)
    (evil-delete (point-at-bol) (point))))

(define-key evil-normal-state-map (kbd "gd") 'lsp-find-definition)

;; Changes such that it moves naturally up and down (not skip lines from visiual perspective)
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

;; Updates the keys in certain modes (e.g. magit can use hjkl etc. etc.)
  (use-package evil-collection
    :after (evil magit)
    :config
    (evil-collection-init))

(use-package general
  :init (general-auto-unbind-keys)
  :config
  (general-evil-setup t)
  (general-create-definer jmacs/leader-keys
                          :keymaps '(normal insert visual emacs dired-mode-map doc-view-mode-map)
                          :prefix "SPC"
                          :global-prefix "C-f"))

(jmacs/leader-keys
 "f" '(counsel-find-file :which-key "find file")
 "e" '(eval-last-sexp :which-key "eval last exp")
 "SPC" '(counsel-M-x :which-key "runs command")
 "g" '(magit :which-key "magit")
 "p" '(projectile-command-map :which-key "projectile command map")
 "s" '(counsel-projectile-rg :which-key "search current project")
 "ch" '(hippie-expand :which-key "Autocomplete file path")
 "d" '(dired :which-key "dired")
 "r" '(ranger :which-key "ranger")
 "b" '(:ignore t :which-key "buffers")
 "bb" '(counsel-ibuffer :which-key "switch buffer")
 "bl" '(ibuffer :which-key "list buffers")
 "bk" '(kill-buffer :which-key "kill buffer")
 "bs" '(hydra-buffer-switch/body :which-key "switch buffer quickly")
 "bc" '(clean-buffer-list :which-key "clean unused buffers")
 "t" '(:ignore t :which-key "toggles")
 "tt" '(counsel-load-theme :which-key "choose theme")
 "ts" '(hydra-text-scale/body :which-key "scale text")
 ; "tf" '(hydra-code-level/body :which-key "Different fold level")
 "o" '(:ignore t :which-key "org")
 "oa" '(org-agenda :which-key "agenda")
 "os" '(org-agenda :which-key "schedule")
 "od" '(org-agenda :which-key "deadline")
 "ot" '(org-time-stamp :which-key "time-stamp"))
 (global-set-key [(hyper p)] 'projectile-find-file)
 (global-set-key [(hyper b)] 'neotree-toggle)
 (global-set-key [(hyper .)] 'flyspell-correct-wrapper)
 (global-set-key [(hyper j)] 'shell-pop)
 (global-set-key [(hyper =)] 'text-scale-increase)
 (global-set-key [(hyper -)] 'text-scale-decrease)
 (global-set-key [(hyper t)] 'tab-bar-switch-to-tab)
 (global-set-key [(hyper T)] 'tab-new)
 (global-set-key [(hyper K)] 'tab-bar-close-tab)
 (global-set-key [(hyper k)] 'tab-bar-switch-to-recent-tab)
