Emacs.org
*** PDF
#+begin_src emacs-lisp
  (use-package pdf-tools)
  ; (require 'doc-view-mode)
  ; (define-key doc-view-mode-map "l" 'doc-view-next-line-or-next-page)
  ; (define-key doc-view-mode-map "h" 'doc-view-previous-line-or-previous-page)
  ; (define-key doc-view-mode-map (kbd "C-s") 'isearch-forward-regexp)
#+end_src

* Development
** Ranger
#+begin_src emacs-lisp
(use-package ranger)
#+end_src
** Magit
#+begin_src emacs-lisp
(use-package magit
  :commands (magit-status magit-get-current-branch)
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
(use-package forge) ; Git interface (with example issues)
#+end_src 

** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/programming")
    (setq projectile-project-search-path '("~/programming")))
  (setq projectile-switch-project-action #'projectile-dired)
  (setq projectile-enable-caching nil))
#+end_src
** Tramp
#+begin_src emacs-lisp

#+end_src
** Languages
*** Company
#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  ; (use-package company
  ;   :ensure
  ;   :custom
  ;   (company-idle-delay 0.5) ;; how long to wait until popup
  ;   ;; (company-begin-commands nil) ;; uncomment to disable popup
  ;   :bind
  ;   (:map company-active-map
  ;               ("C-n". company-select-next)
  ;               ("C-p". company-select-previous)
  ;               ("M-<". company-select-first)
  ;               ("M->". company-select-last))
  ;   (:map company-mode-map
  ;   (("<tab>". tab-indent-or-complete)
  ;         ("TAB". tab-indent-or-complete))))
#+end_src
*** Flycheck
#+begin_src emacs-lisp
  (use-package flycheck
    :config
    ;; the default value was '(save idle-change new-line mode-enabled)
    (setq flycheck-check-syntax-automatically '(save mode-enable)))
  
  ; Old things
  ; (use-package flycheck
  ;   :config
  ;   (global-flycheck-mode t)
  ;   (setq flycheck-highlighting-mode t))
  ; (use-package flycheck-aspell)
  ; (use-package flymake-aspell)
  ; (use-package flycheck-vale)
  ; (flycheck-vale-setup)
  ; (flycheck-vale-toggle-enabled)
  ; (flycheck-checkers 'vale)
  ; (setq flycheck-highlighting-mode t)


#+end_src
*** Flyspell
#+begin_src emacs-lisp
  (use-package flyspell)

  ; Start flyspell-mode when text mode is started
  (dolist (hook '(text-mode-hook))
    (add-hook hook (lambda () (flyspell-mode 1))))

  ; For mac to make it detect two finger click on words
    (eval-after-load "flyspell"
      '(progn
         (define-key flyspell-mouse-map [down-mouse-3] #'flyspell-correct-word)
         (define-key flyspell-mouse-map [mouse-3] #'undefined)))

(use-package flyspell-correct-ivy
    :bind ("C-." . flyspell-correct-wrapper)
    :init
    (setq flyspell-correct-interface #'flyspell-correct-ivy))
#+end_src

*** Yasnippet
#+begin_src emacs-lisp
(use-package yasnippet
  :ensure
  :config
  (yas-reload-all)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  (add-hook 'text-mode-hook 'yas-minor-mode))
#+end_src
*** TypeScript
#+begin_src emacs-lisp
;  (use-package typescript-mode
;    :mode "\\.ts\\'"
;    :hook (typescript-mode . lsp-deferred)
;    :config
;    (setq typescript-indent-level 2))
#+end_src
*** Rust
Can use rust-mode, however according to: https://robert.kra.hn/posts/2021-02-07_rust-with-emacs/
it is better to use rustic (fork + extensions of rust-mode).
#+begin_src emacs-lisp
  (use-package rustic
    :ensure
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)
                ("M-?" . lsp-find-references)
                ("C-c C-c l" . flycheck-list-errors)
                ("C-c C-c a" . lsp-execute-code-action)
                ("C-c C-c r" . lsp-rename)
                ("C-c C-c q" . lsp-workspace-restart)
                ("C-c C-c Q" . lsp-workspace-shutdown)
                ("C-c C-c s" . lsp-rust-analyzer-status))
    :config
    ;; uncomment for less flashiness
    (setq lsp-eldoc-hook nil)
    (setq lsp-enable-symbol-highlighting nil)
    (setq lsp-signature-auto-activate nil)

    ;; comment to disable rustfmt on save
    (setq rustic-format-on-save t)
    (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

  (defun rk/rustic-mode-hook ()
    ;; so that run C-c C-c C-r works without having to confirm, but don't try to
    ;; save rust buffers that are not file visiting. Once
    ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
    ;; no longer be necessary.
    (when buffer-file-name
      (setq-local buffer-save-without-query t)))
#+end_src
*** Python
#+begin_src emacs-lisp
(use-package lsp-python-ms
  :init (setq lsp-python-ms-auto-install-server t)
  :hook (python-mode . (lambda ()
                          (require 'lsp-python-ms)
                          (lsp))))  ; or lsp-deferred
#+end_src
#+begin_src emacs-lisp
    (use-package pyvenv
      :defer t
      :diminish
      :config
      (setenv "WORKON_HOME" "~/.pyenv/versions/")
      ; Show python venv name in modeline
          (setq pyvenv-mode-line-indicator '(pyvenv-virtual-env-name ("[venv:" pyvenv-virtual-env-name "] ")))
          (pyvenv-mode t))
#+end_src
*** Haskell
#+begin_src emacs-lisp
(use-package lsp-haskell)
(add-hook 'haskell-mode-hook #'lsp)
(add-hook 'haskell-literate-mode-hook #'lsp)
#+end_src
*** C/C++
#+begin_src emacs-lisp
(use-package cmake-mode)
#+end_src
** Electric
#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src>
** Terminal
#+begin_src emacs-lisp
(use-package shell-pop
  :config
  (setq shell-pop-shell-type (quote ("ansi-term" "*ansi-term*" (lambda nil (ansi-term shell-pop-term-shell)))))
  (setq shell-pop-term-shell "/bin/zsh")
  ;; need to do this manually or not picked up by `shell-pop'
  (shell-pop--set-shell-type 'shell-pop-shell-type shell-pop-shell-type))
#+end_src
** Git 
#+begin_src emacs-lisp
  (use-package diff-hl)
#+end_src

* Packages
** Swiper (fuzzy search)
#+begin_src emacs-lisp
  (use-package swiper) ; Fuzzy search in files
#+end_src
** UI
*** rainbow-delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters ; Rainbow paranteses
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
*** which-key
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+end_src
*** helpful
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable))
#+end_src
*** doom
**** doom-themes
#+begin_src emacs-lisp
(use-package doom-themes
  :init (load-theme 'doom-moonlight t))
#+end_src
**** doom-modeline
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :config (setq doom-modeline-python-executable "python3"))
#+end_src

*** Command Log
#+begin_src emacs-lisp
  (use-package command-log-mode) ; For displaying commands
#+end_src
*** All the icons
#+begin_src emacs-lisp
  (use-package all-the-icons)
#+end_src
*** counsel
This package shows extra information when running the command buffer (as what keybinding is bind to it).
#+begin_src emacs-lisp
(use-package counsel ; Some nice stuff (helper for M-x etc)
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history))
  :config
  (setq ivy-initial-inputs-alist nil))
#+end_src

*** ivy
#+begin_src emacs-lisp
(use-package ivy
  :init (ivy-mode 1)
  :diminish
  :bind (("C-s" . swiper)
	 :map ivy-minibuffer-map
	 ("TAB" . ivt-alt-done)
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill))
  )
#+end_src
*** ivy-rich
#+begin_src emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))
#+end_src
** Hydra
This package is good for writing quick functions.
*** use-package
#+begin_src emacs-lisp
(use-package hydra)
#+end_src
*** text-scale
#+begin_src emacs-lisp
(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))
#+end_src
