Emacs.org
*** buffer-switch
#+begin_src emacs-lisp
(defhydra hydra-buffer-switch (:timeout 4)
  "switch buffer"
  ("j" previous-buffer)
  ("k" next-buffer)
  ("f" nil "finished" :exit t))
#+end_src

*** code-level
#+begin_src emacs-lisp
    (defun code-level-value-changer (key-code)
      (if "up"
          ()))

    (defhydra hydra-code-level (:timeout 4)
      "switch buffer"
        ("j" (set-selective-display (- selective-display 1)))
        ("k" (set-selective-display (+ selective-display 1)))
        ("f" nil "finished" :exit t))

    ; (set-selective-display nil)
    ; (+ 1 selective-display)
    ; ()
#+end_src
* Org Mode
** Auto-tangle Configuration Files
#+begin_src emacs-lisp
   ;; Automatically tangle the Emacs.org config file when it is saved
   (defun jmacs/org-babel-tangle-config ()
     (when (string-equal (buffer-file-name)
                                    (expand-file-name "~/.emacs.d/Emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
         (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jmacs/org-babel-tangle-config)))
#+end_src

** Org Mode Setup
*** jmacs
#+begin_src emacs-lisp
  (defun jmacs/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil))

  ; (defun jmacs/org-font-setup ()
  ;   ;; Replace list hyphen with dot
  ;   (font-lock-add-keywords 'org-mode
  ;                           '(("^ *\\([-]\\) "
  ;                              (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))
#+end_src

*** org (use-package)
#+begin_src emacs-lisp
  (use-package org
    :hook (org-mode . jmacs/org-mode-setup)
    :config
    ; ▼
    (setq org-ellipsis " ▼"
          org-hide-emphasis-markers t)
    (setq org-agenda-start-with-log-mode t)
    (setq org-src-tab-acts-natively t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (require 'org-faces)
    (setq org-image-actual-width nil)

    (setq org-agenda-files
          '("~/.emacs.d/Tasks.org"
            "~/Personal/Birthdays.org"
            "~/Personal/Habits.org"))

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
          '(("TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)"))))

#+end_src

#+RESULTS:
| org-tempo-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | jmacs/org-mode-visual-fill | org-appear-mode | jmacs/org-mode-setup | (lambda nil (add-hook 'after-save-hook #'jmacs/org-babel-tangle-config)) | (lambda nil (display-line-numbers-mode 0)) |

*** refile
**** Target files
#+begin_src emacs-lisp
  (setq org-refile-targets
        '(("Archive.org" :maxlevel . 1)
          ("Tasks.org" :maxlevel . 1)))
#+end_src
**** Settings
#+begin_src emacs-lisp
  ;; Save ORG buffers after refiling!
  (advice-add 'org-refile :after 'org-save-all-org-buffers)
#+end_src

*** Custom Agenda Views
#+begin_src emacs-lisp
  ;; Configure custom agenda views
  (setq org-agenda-custom-commands
   '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))
      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

    ("n" "Next Tasks"
     ((todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))))

    ("W" "Work Tasks" tags-todo "+work-email")

    ;; Low-effort next actions
    ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
     ((org-agenda-overriding-header "Low Effort Tasks")
      (org-agenda-max-todos 20)
      (org-agenda-files org-agenda-files)))

    ("w" "Workflow Status"
     ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
             (org-agenda-files org-agenda-files)))
      (todo "REVIEW"
            ((org-agenda-overriding-header "In Review")
             (org-agenda-files org-agenda-files)))
      (todo "PLAN"
            ((org-agenda-overriding-header "In Planning")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
             (org-agenda-files org-agenda-files)))
      (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
             (org-agenda-files org-agenda-files)))
      (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
             (org-agenda-files org-agenda-files)))
      (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
             (org-agenda-files org-agenda-files)))))))
#+end_src

*** Capture Templates
#+begin_src emacs-lisp
(setq org-capture-templates
    `(("t" "Tasks / Projects")
      ("tt" "Task" entry (file+olp "~/.emacs.d/Tasks.org" "Inbox")
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

      ("j" "Journal Entries")
      ("jj" "Journal" entry
           (file+olp+datetree "~/Personal/journal/journal.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
           :clock-in :clock-resume
           :empty-lines 1)
      ("jm" "Meeting" entry
           (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
           "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
           :clock-in :clock-resume
           :empty-lines 1)

      ("w" "Workflows")
      ("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
           "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

      ("m" "Metrics Capture")
      ("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
       "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)))
#+end_src

**** Hot Keys
#+begin_src emacs-lisp
(define-key global-map (kbd "C-c j")
  (lambda () (interactive) (org-capture nil "jj")))
#+end_src

*** Tags
#+begin_src emacs-lisp
(setq org-tag-alist
      '((:startgroup)
	(:endgroup)
	("@errand" .?E)
	("@home" . ?H)
	("@work" . ?W)
	("agenda" . ?a)
	("planning" . ?p)
	("publish" . ?P)
	("batch" . ?b)
	("note" . ?n)
	("idea" . ?i)))
#+end_src

** Visual
*** (org-)Appear
#+begin_src emacs-lisp
(use-package org-appear
    :hook (org-mode . org-appear-mode))
#+end_src

*** Level Style
#+begin_src emacs-lisp
        (with-eval-after-load 'org-faces
        (dolist (face '((org-level-1 . 1.2)
                        (org-level-2 . 1.1)
                        (org-level-3 . 1.05)
                        (org-level-4 . 1.0)
                        (org-level-5 . 1.1)
                        (org-level-6 . 1.1)
                        (org-level-7 . 1.1)
                        (org-level-8 . 1.1)))
          (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))
          (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
          (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
          (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
          (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
          (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
          (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
          (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

*** Column (visual fill) 
#+begin_src emacs-lisp
(defun jmacs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . jmacs/org-mode-visual-fill))
#+end_src

